클래스

def 중요변수(변수, 변수, 변수): - 함수 설정
  print("{0} {1} {2}".format(변수, 변수, 변수)
        
중요 변수(변수 or "내용", 변수 or "내용", 변수 or "내용") - 함수 출력 
        
class 이름: - 클래스 만들기
     def __init__(self, 변수1, 변수2, 변수3):
        self.변수1 = 변수1
        self.변수2 = 변수2
        self.변수3 = 변수3
        print("{0} {1} {2}".format(self.변수2, self.변수1, self.변수3)
변수 = 이름(문자열, 문자열, 문자열) - 클래스에 맞쳐서 출력
---------------------------------------------------------------------------------------------------------------------------------------
__init__ - 생산자(자동 호출)
              
-self를 제외하고 동일한 계수를 넘겨야함
---------------------------------------------------------------------------------------------------------------------------------------
